liuxuming/trochili/trochili/inc/cpu/tcl.stm32f103.h
/*************************************************************************************************
 *                                     Trochili RTOS Kernel                                      *
 *                                  Copyright(C) 2016 LIUXUMING                                  *
 *                                       www.trochili.com                                        *
 *************************************************************************************************/
#ifndef _TCL_STM32_F103_H
#define _TCL_STM32_F103_H

/* STM32F103RBT6, Cortex-M3 72MHz, 128kb Flash, 20kb SRAM */
#define WWDG_IRQ_ID             (0)    
#define PVD_IRQ_ID              (1)
#define TAMPER_IRQ_ID           (2)
#define RTC_IRQ_ID              (3)
#define FLASH_IRQ_ID            (4)
#define RCC_IRQ_ID              (5)
#define EXTI0_IRQ_ID            (6)
#define EXTI1_IRQ_ID            (7)
#define EXTI2_IRQ_ID            (8)
#define EXTI3_IRQ_ID            (9)
#define EXTI4_IRQ_ID            (10)
#define DMA1_Channel1_IRQ_ID    (11)
#define DMA1_Channel2_IRQ_ID    (12)
#define DMA1_Channel3_IRQ_ID    (13)
#define DMA1_Channel4_IRQ_ID    (14)
#define DMA1_Channel5_IRQ_ID    (15)
#define DMA1_Channel6_IRQ_ID    (16)
#define DMA1_Channel7_IRQ_ID    (17)
#define ADC1_2_IRQ_ID           (18)
#define USB_HP_CAN1_TX_IRQ_ID   (19)
#define USB_LP_CAN1_RX0_IRQ_ID  (20)
#define CAN1_RX1_IRQ_ID         (21)
#define CAN1_SCE_IRQ_ID         (22)
#define EXTI9_5_IRQ_ID          (23)
#define TIM1_BRK_IRQ_ID         (24)
#define TIM1_UP_IRQ_ID          (25)
#define TIM1_TRG_COM_IRQ_ID     (26)
#define TIM1_CC_IRQ_ID          (27)
#define TIM2_IRQ_ID             (28)
#define TIM3_IRQ_ID             (29)
#define TIM4_IRQ_ID             (30)
#define I2C1_EV_IRQ_ID          (31)
#define I2C1_ER_IRQ_ID          (32)
#define I2C2_EV_IRQ_ID          (33)
#define I2C2_ER_IRQ_ID          (34)
#define SPI1_IRQ_ID             (35)
#define SPI2_IRQ_ID             (36)
#define USART1_IRQ_ID           (37)
#define USART2_IRQ_ID           (38)
#define USART3_IRQ_ID           (39)
#define EXTI15_10_IRQ_ID        (40)
#define RTCAlarm_IRQ_ID         (41)
#define USBWakeUp_IRQ_ID        (42)



#endif
